cfd/cases/leg_V3trap_U008_open/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 1;
vertices
(
    (-0.3918 -0.2842 -0.3758)
    (0.3608 -0.2842 -0.3758)
    (0.3608 0.2842 -0.3758)
    (-0.3918 0.2842 -0.3758)
    (-0.3918 -0.2842 0.1839)
    (0.3608 -0.2842 0.1839)
    (0.3608 0.2842 0.1839)
    (-0.3918 0.2842 0.1839)
);
blocks ( hex (0 1 2 3 4 5 6 7) (47 36 35) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet  { type patch; faces ((1 2 6 5)); }    // +x 端：来流从这里吹向 -x
    outlet { type patch; faces ((0 4 7 3)); }    // -x 端
    sides  { type patch; faces ((0 1 5 4) (3 7 6 2)); }
    bottom { type patch; faces ((0 3 2 1)); }
    top    { type patch; faces ((4 5 6 7)); }    // 刚盖近似自由液面（单相）
);
mergePatchPairs ();
